Autodesk.Revit.DB.BrowserOrganization.GetCurrentBrowserOrganizationForSchedules(Autodesk.Revit.DB.Document)
Gets the Autodesk.Revit.DB.BrowserOrganization  that applies to the Schedules section of the project browser.
document:
Revit document from which to get the organization data.
Returns:
The BrowserOrganization for schedules, or null if no schedules sections exist
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.1

Autodesk.Revit.DB.BrowserOrganization.GetCurrentBrowserOrganizationForSheets(Autodesk.Revit.DB.Document)
Gets the Autodesk.Revit.DB.BrowserOrganization that applies to the Sheets section of the project browser.
document:
Revit document from which to get the organization data.
Returns:
The BrowserOrganization for sheets, or null if no sheets exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.BrowserOrganization.GetCurrentBrowserOrganizationForViews(Autodesk.Revit.DB.Document)
Gets the Autodesk.Revit.DB.BrowserOrganization  that applies to the Views section of the project browser.
document:
Revit document from which to get the organization data.
Returns:
The BrowserOrganization for views, or null if no view sections exist
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.BrowserOrganization.GetFolderItems(Autodesk.Revit.DB.ElementId)
Returns a collection of leaf Autodesk.Revit.DB.FolderItemInfo objects each containing the given element Id.
Remarks:
Each returned  Autodesk.Revit.DB.FolderItemInfo includes the folder name and the corresponding folder parameter Id.
elementId:
Element id located at a leaf position in the project browser.
Returns:
An array of FolderItemInfo objects.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.BrowserOrganization.AreFiltersSatisfied(Autodesk.Revit.DB.ElementId)
Determines if the given element satisfies the filters defined by the browser organization.
elementId:
The element to check.
Returns:
True if the given element satisfies the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.BrowserOrganization.Type
Get BrowserOrganizationType.
Since:
2023